using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace WindowsFormsApp1
{
	public partial class Form1 : Form
	{

		string MaturaAuthor, MaturaQuote;
		int CounterRight = 0, CounterWrong = 0;
		public Tuple<string, string> Matura()
		{
			List<string> authors = new List<string> { "Вазов", "Дебелянов", "Вапцаров", "Багряна", "Ботев", "Славейков", "Смирненски", "Яворов", "Милев", "Далчев" };
			Dictionary<string, List<string>> quotes = new Dictionary<string, List<string>>();


			foreach (string author in authors)
			{
				quotes[author] = new List<string>();
			}


			quotes["Вазов"].Add("Език свещен на моите деди език на мъки, стонове вековни, език на тая, дето ни роди за радост не - за ядове отровни.");
			quotes["Вазов"].Add("Език свещен на моите деди език на мъки, стонове вековни, език на тая, дето ни роди за радост не - за ядове отровни.");
			quotes["Вазов"].Add("Не си можал да въплътиш във теб създаньята на творческата мисъл! И не за песен геният ти слеп - за груб брътвеж те само бил орисал!");
			quotes["Вазов"].Add("Ох, аз ще взема черния ти срам и той ще стане мойто вдъхновенье, и в светли звукове ще те предам на бъдещото бодро поколенье;");
			quotes["Вазов"].Add(" Но вълни по-нови от орди дивашки гълтат, потопяват орляка юнашки... Йоще миг - ще падне заветният хълм. Изведнъж Радецки пристигна със гръм.");
			quotes["Вазов"].Add("Горските долини трепетно повтарят на боя ревът. Пристъпи ужасни! Дванайсетий път гъсти орди лазят по урвата дива и тела я стелят, и кръв я залива. Бури подир бури! Рояк след рояк! Сюлейман безумний сочи върха пак и вика: Търчете! Тамо са раите! И ордите тръгват с викове сърдити, и Аллах! гръмовно въздуха разпра.");
			quotes["Вазов"].Add("Сега съм у дома. Над мен Еленин връх боде лазурний свод и мен при себе кани; отсреща Бричебор ми праща здравий дъх на своите ели и бори великани; а Царев връх от юг издига се огромен с плешивия си лоб и царския си спомен.");
			quotes["Вазов"].Add("Сега съм у дома, в сърцето съм на Рила. Световните злини, тревоги са далеч - за тях е тя стена до небеса турила - усещам се добър, почти невинен веч. Духът ми се цери след жизнената битва, вкушавам сладък мир във песни и молитва.");
			quotes["Вазов"].Add("Сега съм у дома - участник в рилский хор. Аз тук не се родих - тук бих желал да тлея - под горский вечен шум - дълбока епопея - и на Еленин връх под вечно будний взор; да имам гроб, подир живот-синджир теглила, в величествените обятия на Рила.");
			quotes["Вазов"].Add("Ти рай си, да; но кой те прилично оценява? Не те познават даже децата ти сами и твойто име свято не рядко ги срами! Какъв ли свят прекрасен в теб йоще скрит остава? Какви ли тайни дремят, богатства, красоти по твоите долини, поля и висоти? Ти рай си, да; но кой те прилично оценява?");
			quotes["Вазов"].Add("Ах, ний живейме в тебе, кат същи чужденци, и твоят дивен вид ни не стряска, не привлича. Рогачът в планините по-много те обича, по-харно те познават крилатите певци, но ний не видим нищо, нам нищо не ни тряба, доволно е, че даваш покривката и хляба, и ние в тебе, майко, ще умрем чужденци!");
			quotes["Вазов"].Add("Коя земя от теб е по-пъстра, по-богата? Ти сбираш в едно всички блага и дарове: хляб, свила, рози, нектар, цветя и плодове, на Изтокът светлика, на Югът аромата; горите ти са пълни с хармония и хлад, долините с трендафил, гърдите с благодат. Коя земя от теб е по-пъстра, по-богата?");
			quotes["Вазов"].Add("Зла бедност! Неволя! Души затъпели,набърчени булки, деца застарели. Къс ръжено тесто в пушливо огнище загрява се там за гърла изгладнели.");
			quotes["Вазов"].Add("Тогаз за народа се бихте смислили и срам, угризение бихте сетили. И вашето сърце със болка заби ще. О, доста на думи сте нази любили");
			quotes["Вазов"].Add("Къде вървим, не мислим твърде, посока няма в наший път, спокойно бият тесни гърди, кога от злоба не кипът.");
			quotes["Вазов"].Add("Стресни се, племе закъсняло! Живейш ли, мреш ли, ти не знайш! След теб потомство иде цяло - какво ще да му завещайш?");
			quotes["Вазов"].Add("Ил твоят път се веч изравни? Ил нямаш други ти съдби ? Ил нямаш ти задачи славни и цяло бъдеще с борби ?");
			quotes["Вазов"].Add("ох, аз ще те обриша от калта и в твоя чистий бляск ще те покажа, и с удара на твойта красота аз хулниците твои ще накажа.");

			quotes["Далчев"].Add("В ъглите расне неусетно вечерната дрезгавина и вехне есенното слънце върху килимите на пода, а светят жълти зимни дюли, наредени върху комода като голяма броеница от кехлибарени зърна.");
			quotes["Далчев"].Add("Какви лица ли отразило ревниво пази огледалото? То сякаш е един прозорец, отворен в друг предишен свят. Часовникът е вече млъкнал и в неговия чер ковчег лежат умрели часовете и неподвижно спи махалото.");
			quotes["Далчев"].Add("Тези черни ръце връз прострените бели покривки като черни оголени клони на зимния сняг, тези сухи ръце и ракривени болни усмивки, и очи може би вече вгледани в другия свят.");
			quotes["Далчев"].Add("Тишината и здрачът и тези прозорци тъжовни със петна от мухи и с бразди от прахът и дъждът, и звънът, и звънът на големия стенен часовник сякаш тежките стъпки на близката смърт.");
			quotes["Далчев"].Add("Прилитат и отлитат птиците, изгрява ден, залязва ден: аз дните си като страниците прелиствам уморен.");
			quotes["Далчев"].Add("Години да четеш за чуждия живот на някой чужд, а твоят, никому ненужен, да мине глух и пуст.");
			quotes["Далчев"].Add("До мене ти не стигна никога, о, зов на любовта, и аз изгубих зарад книгите живота и света.");
			quotes["Далчев"].Add("Нямаш нито жили, нито нерви, нямаш нашата злочеста плът. Съвестта и хилядите червеи никога не те гризат.");
			quotes["Далчев"].Add("Ти не си изпитвал още жаждата от която почват вси беди: не грешиш ти никога: не раждаш, пък и сам си нероден.");
			quotes["Далчев"].Add("Ти си свят. Не затова ли некога в огнените стари векове от гранит и мрамор е човекът ваял свойте богове?");
			quotes["Далчев"].Add("Аз не излизам никога от къщи и моите еднички гости са годините, а много пъти пожълтяваха градините и аз не съм навярно вече същият. Отдавна всички книги са прочетени и всички пътища на спомена са минати, и ето сякаш сто години как разговарям само със портретите.");
			quotes["Далчев"].Add("И аз лежа на дървения под с коси от леден лепкав пот измокрени, и аз умирам в стаята под покрива тъй близко до самия небосвод.");
			quotes["Далчев"].Add("А долу преминават автомобили, трамваи като ветрове фучат и смехове и крясъци звучат, и тътнат кръчмите и публичните домове.");
			quotes["Далчев"].Add("И за да заглуша във себе си скръбта, понякога аз сядам на прозореца и яростно оттам замервам хората със пръст от старите саксии без цветя.");
			quotes["Далчев"].Add("Не искам състрадание от хората! Аз имам всичко: моя е смъртта. И аз ще се изплезя на света, обесен върху черния прозорец.");
			quotes["Далчев"].Add("Те вървят върху сребърен път и под мрежа от сребърни клони, посребрени листа се отронват, дъждове от листа ги валят.");
			quotes["Далчев"].Add("Там е само вълшебната птица с лъчезарните златни пера; мойто братче и мойта сестра нея търсят от цяла седмица.");
			quotes["Далчев"].Add("Чак на седмия ден призори ето тя затрептява, изгрява и във миг се запалва гората от горящите нейни пера.");
			quotes["Далчев"].Add("Дъждът гризе мазилката и бяга през счупените водостоци от олово и като пот по челото на болен по сивите стени избива влага. ");

			quotes["Ботев"].Add("Бащино ли съм пропил имане, тебе ли покрих с дълбоки рани, та мойта младост, мале, зелена съхне и вехне люто язвена?!");
			quotes["Ботев"].Add("Весел ме гледат мили другари, че с тях наедно и аз се смея, но те не знаят, че аз веч тлея, че мойта младост слана попари!");
			quotes["Ботев"].Add("Освен теб, мале, никого нямам, ти си за мене любов и вяра; но тука вече не се надявам тебе да любя: сърце догаря!");
			quotes["Ботев"].Add("Една сал клета, една остана: в прегръдки твои мили да падна, та туй сърце младо, таз душа страдна да се оплачат тебе горкана...");
			quotes["Ботев"].Add("Отечество мило любя, неговият завет пазя; но себе си, брате, губя, тия глупци като мразя.");
			quotes["Ботев"].Add("Мечти мрачни, мисли бурни са разпалили душа млада; ах, ръка си кой ще турне на туй сърце, дето страда?");
			quotes["Ботев"].Add("Често, брате, скришом плача над народен гроб печален; но, кажи ми, що да тача в тоя мъртъв свят коварен?");
			quotes["Ботев"].Add("Свещена глупост! Векове цели разум и совест с нея се борят; борци са в мъки, в неволи мрели, но, кажи, що са могли да сторят!");
			quotes["Ботев"].Add("Той ли, ил някой негов наместник, син на Лойола и брат на Юда, предател верен и жив предвестник на нови тегла за сиромаси, нов кърджалия в нова полуда, кой продал брата, убил баща си?!");
			quotes["Ботев"].Add("Сочи народът, и пот от чело кървав се лее над камък гробен; кръстът е забит във живо тело, ръжда разяда глозгани кости, смок е засмукал живот народен, смучат го наши и чужди гости!");
			quotes["Ботев"].Add("А бедният роб търпи и ние без срам, без укор, броиме време, откак е в хомот нашата шия, откак окови влачи народа, броим и с вяра в туй скотско племе чакаме и ний ред за свобода!");
			quotes["Ботев"].Add("Кажи им, майко, да помнят, да помнят мене да търсят: бяло ми месо по скали, по скали и по орляци, черни ми кърви в земята, земята, майко, черната! ");
			quotes["Ботев"].Add("Берете цветя в градина, късайте бръшлян и здравец, плетете венци и китки да кичим глави и пушки!");
			quotes["Ботев"].Add("Забрави туй време га плачех за поглед мил и за въздишка: роб бях тогаз - вериги влачех, та за една твоя усмивка, безумен аз светът презирах и чувства си в калта увирах!");
			quotes["Ботев"].Add("О, махни тез думи отровни! Чуй как стене гора и шума, чуй как ечат бури вековни, как нареждат дума по дума - приказки за стари времена и песни за нови теглила!");
			quotes["Ботев"].Add("Запей и ти песен такава, запей ми, девойко, на жалост, запей как брат брата продава, как гинат сили и младост, как плаче сирота вдовица и как теглят без дом дечица!");
			quotes["Ботев"].Add("Ах, тез песни и таз усмивка кой глас ще ми викне, запее? Кървава да вдигна напивка, от коя и любов немее, пък тогаз и сам ще запея що любя и за що милея!...");
			quotes["Ботев"].Add("Тоз, който падне в бой за свобода, той не умира: него жалеят земя и небо, звяр и природа, и певци песни за него пеят...");
			quotes["Ботев"].Add("Една му с билки раната върже, друга го пръсне с вода студена, трета го в уста целуне бърже - и той я гледа - мила, засмена!");
			quotes["Ботев"].Add("Ох, зная, зная, ти плачеш, майко, затуй, че ти си черна робиня, затуй, че твоят свещен глас, майко, е глас без помощ, глас във пустиня.");
			quotes["Ботев"].Add("Плачи! Там близо край град София стърчи, аз видях, черно бесило, и твой един син, Българийо, виси на него със страшна сила.");
			quotes["Ботев"].Add("Гарванът грачи грозно, зловещо, псета и вълци вият в полята, старци се молят богу горещо, жените плачат, пищят децата.");
			quotes["Ботев"].Add("Не ти, комуто се кланят калугери и попове и комуто свещи палят православните скотове");
			quotes["Ботев"].Add("не ти, боже на лъжците, на безчестните тирани, не ти, идол на глупците, на човешките душмани!");
			quotes["Ботев"].Add("Подкрепи и мен ръката, та кога въстане робът, в редовете на борбата да си найда и аз гробът!");

			quotes["Смирненски"].Add("Край нас се вие бич, над нас тежи хомот и робския закон на жълтия метал; ний раснем в нищета, ний гаснем сред печал и ръсим в своя друм сълзи и кървав пот - ний, бледи смъртници - родени за живот.");
			quotes["Смирненски"].Add("А ний сме океан от огнени вълни, величествен керван към светли висоти; Чрез нашите сърца вселената тупти, живота се крепи на раменете ни, но ний сме океан от стенещи вълни.");
			quotes["Смирненски"].Add("На земните блага всевечни сме творци, а нужда ни души до хладната си гръд. Под черните крила на дебнещата смърт привеждаме чела със трънени венци - ний, вечните творци, ний морните борци.");
			quotes["Смирненски"].Add("Но иде ден на съд! Над майката земя надвисва ураган и в громкия му зов преплитат се ведно омраза и любов, а майката земя възсепва се сама, потъпкала греха, отърсила срама.");
			quotes["Смирненски"].Add("Нощта е черна и зловеща, нощта е ледна като смърт. В разкъсаната земна гръд струи се бавно кръв гореща. В димящите развалини безокий демон на войната развял е хищно знамената и меч въз меч безспир звъни.");
			quotes["Смирненски"].Add("Сред мрака непрогледно гъст стърчи злокобен силует на някакъв грамаден кръст, и хилядни тълпи отвред вървят, подгонени натам от яростта на златний бог.");
			quotes["Смирненски"].Add("А над Берлин, потънал в ситен скреж и лунни сребросинкави петна, внезапно екна първия гърмеж и ехото в безумний си летеж раздра задрямалата тишина.");
			quotes["Смирненски"].Add("След него втори, трети.......ето в миг изтръпна в ужас снежния Берлин. Нощта изпълни се с гърмеж и вик и пламъкът изви червен език, блестящ над покривите кат рубин...");
			quotes["Смирненски"].Add("А стиснал карабината в ръце, Йохан ги среща с гръм и ги зове: Елате вий, аз с каменно лице ще срещна щика в своето сърце! Елате вий, престъпни синове!");
			quotes["Смирненски"].Add("Но не пролет и химн покрай мен позвъни, не поръси ме ябълков цвят: пред раззинали бездни до черни стени окова ме злодей непознат.");
			quotes["Смирненски"].Add("В полумрака видях изтерзани лица, вред зачух плачове като в сън и жестока закана на гневни сърца се преплете с оковния звън.");
			quotes["Смирненски"].Add("Аз познах свойте братя във робски керван, угнетени от Златний телец; и човешкия Дух — обруган, окован, аз го зърнах под трънен венец.");
			quotes["Смирненски"].Add("Привечер. Спуска се траурен здрач, ситен снежец завалява, спира цигулката горестен плач - стареца немощно става.");
			quotes["Смирненски"].Add("Там - от скованата в мраз висина - мигом през тънкия облак хвърля му поглед печална луна, фосфорно бледа и обла.");
			quotes["Смирненски"].Add("А из улицата шумна, под гирлянди електрични, ето малката цветарка бърза от локал в локал, де оркестрите разливат плавни звукове ритмични и от тях се рони сякаш скрита мъка и печал.");
			quotes["Смирненски"].Add("С погледа смутен и влажен на прокудена русалка между масите пристъпя и предлага плахо тя: златожълти хризантеми в кошничка кокетно малка и усмивката смирена по рубинени уста.");
			quotes["Смирненски"].Add("Върху стройното й тяло, върху младостта й цветна, като черни пипала се плъзгат погледи отвред и в усмивки иронични блика мисъл неприветна, че цветята се купуват, а и тя е чуден цвет.");
			quotes["Смирненски"].Add("Вървя край смълчаните хижи, в море непрогледна мъгла, и вечната бедност и грижа ме гледат през мътни стъкла.");
			quotes["Смирненски"].Add("Но ето къщурка позната; в прозореца детска глава; и грубо гърмят в тишината пияни хрипливи слова.");
			quotes["Смирненски"].Add("Завесата мръсна, продрана, и едър мъглив силует размахва ръцете в закана, от помисли странни обзет.");
			quotes["Смирненски"].Add("Пламва стомана елмазена, вие се, съска, пълзи — с тежките чукове смазани, пръска тя златни сълзи.");
			quotes["Смирненски"].Add("Той е — слепия старик се връща, с него натоварено дете, потопени в хаоса намръщен, бавно, бавно се разтапят те.");
			quotes["Смирненски"].Add("Струят се без ред бледожълти петна от прозореца в скреж, и — разкъсващ, зловещ — през стъклата процежда се плач на жена, и горят и трептят свещ до свещ.");
			quotes["Смирненски"].Add("И пак край смълчаните хижи вървя в бледосиня мъгла и вечната бедност и грижа ме гледат през мътни стъкла.");
			quotes["Смирненски"].Add("Като че злорадствени песни напяват незнайни беди, и трепнат, угаснат и блеснат над затвора двете звезди.");

			quotes["Яворов"].Add("Кой ли може неволя клетнишка изказа, макар и - вчерашна се дума? Да беше мор, да беше чума, че в гроба гърло не гладува, ни жадува!");
			quotes["Яворов"].Add("Но мина зима снеговита, отиде пролет дъждовита - и знойно лято позлати до вчера злъчни широти.");
			quotes["Яворов"].Add("Затопли радост на сърцето, усмивка свърне на лицето, въздишка кротка, пръст до пръст - ръка неволно прави кръст:");
			quotes["Яворов"].Add("Миражите са близо, - пътя е далек. Учудено засмяна жизнерадост на неведение и алчна младост, на знойна плът и призрак лек... Миражите са близо, - пътя е далек: защото тя стои в сияние пред мене, стои, ала не чуе, кой зове и стене, - тя - плът и призрак лек!");
			quotes["Яворов"].Add("Мъчително глава се към глава навежда, - те няма да се чуят: искат и не могат. Те шепнат може би - от що се те боят? Напрегнато ръце се към ръце протягат и пак се не докосват! Искат и не могат");
			quotes["Яворов"].Add("Простира нощта крилото си - и веч едва се мяркат очертани на тъмномодър небосклон замислените великани на чутният Атон. ");
			quotes["Яворов"].Add("И пламва двоен пламък, дето се докосна и в каменът аз чуя две сърца... Навсякъде сявга раздвоя несносна и чезнещи в пепел враждебни лица.");
			quotes["Яворов"].Add("Като залутан слънчев лъч игрива, маскирана вакханка с волен смях напреде ми се мярна. Да разлива коса поток от злато аз видях въз хитра голота на свежо рамо. И сетне - миг - разкършена снага изчезна в роя като блян.");
			quotes["Яворов"].Add("Ден карнавален, времето неделно зовеше хората навън: тълпа гъмжеше из града. Безцелно, в печал, която нивга не заспа, се лутах аз.");
			quotes["Яворов"].Add("И с вяра ще разкрия аз прегръдки, загледан в две залюбени очи, и тих ще пия техните лъчи, - ще пия светлина, лечебни глътки. И пак ще се обърна просветлен света да видя цял при ярък ден.");
			quotes["Яворов"].Add("Страсти и неволи ще хвърлят утре върху тях булото на срам и грях. Булото на срам и грях - не ще го хвърлят върху тях страсти и неволи.");
			quotes["Яворов"].Add("Душата ми се моли, дете, душата ми се моли... Не искат и не обещават те! - Две хубави очи. Музика, лъчи в две хубави очи. Душата на дете...");
			quotes["Яворов"].Add("Един и същ на битието с урагана, аз шеметно се нося, дух из океана на тъмнина нестресвана от сън за ден, без нявга мигом негде да застана, напред самотно устремен.");
			quotes["Яворов"].Add("Живота и смъртта крила ми са предвечни, размахани задружно, - близки и далечни предели аз не виждам сред размаха свой; на мигновенията бързотечни изгубих тягостния брой.");
			quotes["Яворов"].Add("Къде отивам аз, терзан от знойна жажда? Мечта подир мечтата гине и се ражда... В тъма и сам - към светлина ли, към любов? Из хаосите явствен се обажда към мене нечий родствен зов.");
			quotes["Яворов"].Add("През тайната на димните потоци звездни, кръз ужаса на гробно млъкналите бездни, заслушан аз минавам, - бди тревожен ум, с надежда за минутите възмездни на стигнат край в безкраен друм.");
			quotes["Яворов"].Add("И може би в безкрая гоня аз граница, с напразно вярван сън за бъдаща зорница - слепец пробуден, сляп отвека и навек... И може би в заключена тъмница от своя зов аз слушам ек.");

			quotes["Дебелянов"].Add("Трепнали край черните стени, стъпките размерено кънтят и след мен невидими вървят жалби за преминалите дни.");
			quotes["Дебелянов"].Add("Образът на милото дете, нявга озарило моя праг, в спомена възкръсва - чист и драг - и скръбта расте, расте, расте...");
			quotes["Дебелянов"].Add("Миналото - ах, остана то тъмен край от скърби заледен и оттам отпраща тя към мен своя скръбен вик:защо, защо?");
			quotes["Дебелянов"].Add("Тук първи път чух възглас: - престани: да вярваш и да дириш - забранен е на любовта плодът - и в зли страни мечтите ти навек ще бъдат пленни.");
			quotes["Дебелянов"].Add("И днес аз бродя в тоя скръбен град - едничък дом на мойта скръб бездомна - аз бродя за утехата нерад -");
			quotes["Дебелянов"].Add("Вървим под тежките крила на буреносна, мощна бран и върху хиледи чела чер жъртвен кръст е начертан.");
			quotes["Дебелянов"].Add("Че светли тайни дух прозря и аз обикнах тоя път, по който земните недра тъй властно мамят и зоват.");
			quotes["Дебелянов"].Add("Венци от слънчеви цветя в долини слънчеви плете и в кротък унес чака тя да дойде нейното дете.");
			quotes["Дебелянов"].Add("Там родни сенки с родна реч посрещат брата и сина, а нейде гордо и далеч плющят победни знамена!...");
			quotes["Дебелянов"].Add("За зора огнеструйна копнея, а слепи ме с лъчите си тя, в пролетта като в есен аз крея, в есента като в пролет цъфтя.");
			quotes["Дебелянов"].Add("Да те пресрещне старата на прага и сложил чело на безсилно рамо, да чезнеш в нейната усмивка блага и дълго да повтаряш: мамо, мамо...");
			quotes["Дебелянов"].Add("Смирено влязъл в стаята позната, последна твоя пристан и заслона, да шъпнеш тихи думи в тишината, впил морен поглед в старата икона: аз дойдох да дочакам мирен заник, че мойто слънце своя път измина...");
			quotes["Дебелянов"].Add("Да се завърнеш в бащината къща, когато вечерта смирено гасне и тихи пазви тиха нощ разгръща да приласкае скръбни и нещастни.");
			quotes["Дебелянов"].Add("Кат бреме хвърлил черната умора, що безутешни дни ти завещаха - ти с плахи стъпки да събудиш в двора пред гостенин очакван радост плаха.");
			quotes["Дебелянов"].Add("Помниш ли, помниш ли тихия двор шъпот и смях в белоцветните вишни? - Ах, не пробуждайте светлия хор, хорът на ангели в дните предишни - ");
			quotes["Дебелянов"].Add("В миг глуха вълна над града се пронесе, в миг всичко в заглъхналост странна потъна, аз сетих и страх и молитви в сърце си и видех света като пропаст бездънна. ");
			quotes["Дебелянов"].Add("Ако загина на война, жал никого не ще попари - изгубих майка, а жена не найдох, нямам и другари. Ала сърце ми не скърби - приневолен живя сирака и за утеха може би смъртта в победа ще дочака.");
			quotes["Дебелянов"].Add("Ще си отида от света - тъй както съм дошъл, бездомен, спокоен като песента, навяваща ненужен спомен.");
			quotes["Дебелянов"].Add("Той не ни е вече враг - живите от враговете бурна ги вълна помете нейде към отсрещний бряг. Ето, в хлътналия слог легнал е спокойно бледен с примирена скръб загледан в свода ясен и дълбок.");
			quotes["Дебелянов"].Add("Кой е той и де е бил? Чий го зов при нас доведе, в ден на вихрени победи да умре непобедил?");
			quotes["Дебелянов"].Add("Клета майчина ръка, ти ли го в неволя черна с думи на любов безмерна утеши и приласка?");
			quotes["Дебелянов"].Add("И нима под вражи стяг готвил е за нас пощада? - Не, той взе, що му се пада, мъртвият не ни е враг!");
			quotes["Дебелянов"].Add("Смешна жал, нелепа жал, в грохотно, жестоко време! Не живот ли да отнеме той живота свой е дал?");

			quotes["Вапцаров"].Add("С живота сме в разпра, но ти не разбирай, че мразя живота. Напротив, напротив! – Дори да умирам, живота със грубите лапи челични аз пак ще обичам! Аз пак ще обичам!");
			quotes["Вапцаров"].Add("За него – Живота – направил бих всичко. – Летял бих със пробна машина в небето, бих влезнал във взривна ракета, самичък, бих търсил в простора далечна планета.");
			quotes["Вапцаров"].Add("Но ето, да кажем, вий вземете, колко? – пшеничено зърно от моята вера, бих ревнал тогава, бих ревнал от болка като ранена в сърцето пантера.");
			quotes["Вапцаров"].Add("Какво ще остане от мене тогава? – Миг след грабежа ще бъда разнищен. И още по-ясно, и още по-право – миг след грабежа ще бъда аз нищо.");
			quotes["Вапцаров"].Add("Ти помниш ли как в нас полека-лека изстиваха последните надежди и вярата в доброто и в човека, в романтиката, в празните копнежи?");
			quotes["Вапцаров"].Add("Опомнихме се. Късно. Бяхме вързани жестоко. Като някакви животни в клетка светкаха очите жадно и търсеха, и молеха пощада.");
			quotes["Вапцаров"].Add("А там - високо във небето, чудно трептяха пак на чайките крилата. Небето пак блестеше като слюда, простора пак бе син и необятен, на хоризонта пак полека-лека се губеха платната всяка вечер и мачтите изчезваха далеко, но ние бяхме ослепели вече.");
			quotes["Вапцаров"].Add("Смутено потръпнах. И стана ми тежко. Но аз понакуцвам в теория и рекох полека, без злоба, човешки, да пробвам със тази история. – Тя, случката, станала в село Могила. Бащата бил скътал пари. Синът ги подушил, вземал ги насила и после баща си затрил.");
			quotes["Вапцаров"].Add("Но в месец, или пък във седмица само властта го открила и... съд. Ала във съдът не потупват по рамото, а го осъждат на смърт. Отвели тогава злодея злосторен, затворили този субект. Но във затвора попаднал на хора и станал ч о в е к.");
			quotes["Вапцаров"].Add("Не зная с каква е закваса заквасен, не зная и как е замесен, но своята участ от книга по-ясна му станала с някаква песен. И после разправял: Брей, как се обърках и ето ти тебе бесило.");
			quotes["Вапцаров"].Add("Как мислите, може би тука се крие един истеричен комплекс? Мислете тъй както си щете, но вие грешите, приятелко, днес. – Човекът спокойно, тъй – дума след дума и твърдо редил песента. ");
			quotes["Вапцаров"].Add("Понякога ще идвам във съня ти като нечакан и неискан гостенин. Не ме оставяй ти отвън на пътя – вратите не залоствай. Ще влезна тихо. Кротко ще приседна, ще вперя поглед в мрака да те видя. Когато се наситя да те гледам – ще те целуна и ще си отида");
			quotes["Вапцаров"].Add("Почакай... как започваше?... Така... Войната свършена... Разбираш ме, нали? И всичко е във нашата ръка, нали така, Лорй?");
			quotes["Вапцаров"].Add("А вънка тъй широк е небосвода!... Блести небето, въздухът блести! И дишаш, дишаш толкова свободно! И сам не вярваш, че това си ти. –");
			quotes["Вапцаров"].Add("Лорй погледна другия в очите (те бяха толкова детински днес), усмихна се и каза, уж сърдито: Какъв си ти мечтател, Фернандес!");
			quotes["Вапцаров"].Add("Ще бъдеш ли поне признателна, че те нахранихме с събития и те напоихме богато с кръвта на хиляди убити.");
			quotes["Вапцаров"].Add("Ще хванеш контурите само, а вътре, знам, ще бъде празно и няма никой да разказва за простата човешка драма.");
			quotes["Вапцаров"].Add("Живот ли бе – да го опишеш? Живот ли бе – да го разровиш? Разровиш ли го – ще мирише и ще горчи като отрова.");
			quotes["Вапцаров"].Add("Като мухи сме мрели есен, жените вили по задушница, изкарвали плача на песен, но само бурена ги слушал.");
			quotes["Вапцаров"].Add("Мъдруваха бащите в къщи: Така било е и ще бъде... А ние плюехме намръщено на оглупялата им мъдрост.");
			quotes["Вапцаров"].Add("Но в многотомните писания, под буквите и редовете ще вика нашето страдание и ще се зъби неприветно –");
			quotes["Вапцаров"].Add("И на шосето, точно на завой, се срещат две луксозни лимузини. Това е нашия герой и нашта героиня. След удара излиза джентълмен и взема във ръцете си чилични като перце примрялото момиче.");
			quotes["Вапцаров"].Add("Та можем ли да любим и скърбим с наивната ви лековерност? Гърдите ни са пълни с дим, а дробовете ни – с каверни.");
			quotes["Вапцаров"].Add("Така ли срещаме на път любимите си с лимузини? – Изгрява любовта ни в труд – сред дим, сред сажди и машини.");
			quotes["Вапцаров"].Add("И този шум и трясък на машини ще трябва непременно да крещиш, да могат думите разбрано да преминат пространството, което те дели. ");
			quotes["Вапцаров"].Add("И този крясък стана сплав, с която бронирахме живота си така, че сложиш ли му прът във колелата - ще счупиш своята ръка...");
			quotes["Вапцаров"].Add("И ти, завод, се мъчиш пак отгоре да трупаш дим и сажди пласт след пласт. Напразно! Ти ни учи да се борим - ще снемем ние слънцето при нас.");
			quotes["Вапцаров"].Add("Разстрел, и след разстрела – червеи. Това е толкоз просто и логично. Но в бурята ще бъдем пак със тебе, народе мой, защото те обичахме!");
			quotes["Вапцаров"].Add("Борбата е безмилостно жестока. Борбата както казват, е епична. Аз паднах. Друг ще ме смени и...");

			quotes["Багряна"].Add("Можеш ли да спреш ти Бистрица, дето иде напролет яростна, разтрошава ледовете си, на мостовете подпорите и излиза от коритото и завлича, мътна, пакостна - къщиците и градинките, и добитъка на хората - в родния ми град?");
			quotes["Багряна"].Add("Можеш ли да спреш ти виното, щом веднъж е закипяло то в бъчвите огромни, взидани, с влага лъхаща наситени, на които с букви кирилски пише черното и бялото - в избите студен, каменни, завещани от дедите ни - в родния ми град?");
			quotes["Багряна"].Add("Как ще спраш ти мене - волната, скитницата, непокорната - родната сестра на вятъра, на водата и на виното, за която е примамица непостижното, просторното, дето все сънува пътища - недостигнати, неминати, - мене как ще спреш?");
			quotes["Багряна"].Add("Може би прабаба тъмноока, в свилени шалвари и тюрбан, е избягала в среднощ дълбока с някой чуждестранен, светъл хан.");
			quotes["Багряна"].Add("Конски тропот може би кънтял е из крайдунавските равнини и спасил е двама от кинжала вятърът, следите изравнил.");
			quotes["Багряна"].Add("Затова аз може би обичам необхватните с око поля, конски бяг под плясъка на бича, волен глас, по вятъра разлян.");
			quotes["Багряна"].Add("Ходиш, гледаш, сякаш обезсвесен, залудо пилееш дни и нощи, божий свят ти станал, казваш, тесен. Не видя ли, не разбра ли още? Неведнъж те рекох и повторих: не помагат билки и магии, кой каквото иска да говори - няма нивга аз гнездо да свия, рожби румени да ти отгледам, в къщи край огнището да шетам. ");
			quotes["Багряна"].Add("Дай ми мене по света да скитам, дай ми сборове, хора, задевки - другите да слушам без насита и сама да пея на припевки.");
			quotes["Багряна"].Add("Сега е тя безкръвна и почти безплътна, безгласна, неподвижна, бездиханна. Очите са притворени и хлътнали. и все едно - дали Мария, или Анна е, и все едно - да молите и плачене, - не ще се вдигнат тънките клепачи, не ще помръднат стиснатите устни - последния въздъх и стон изпуснали.");
			quotes["Багряна"].Add("А внучката ще носи всичко: името, очите, устните, косите - на незримата.");

			quotes["Славейков"].Add("Слепец! За мен залязоха навеки на слънцето лучите - с звуковете на музиката... А едни, едни те даваха живот на моя дух и светлина на гордите ми чувства. Аз доживях самичък да се видя мъртвец приживе, Другите живеят с живота на творенията мои - и само ази зарад тях съм глух. ");
			quotes["Славейков"].Add("В зори ранил на път, аз дишам на лятно утро свежестта - и милва ми душата бодра за лек път охолна мечта.");
			quotes["Славейков"].Add("За лек път, за почивка тиха през ясна вечер в родний кът, където ме с милувка чака на мойто щастие сънят.");
			quotes["Славейков"].Add("Спи езерото; белостволи буки над него свождат вити гранки, и в тихите му тъмни глъбини преплитат отразени сянки.");
			quotes["Славейков"].Add("Треперят, шептят белостволи буки, а то, замряло, нито трепва... Понякога му сал повърхнини дълга от лист отронен сепва.");
			quotes["Славейков"].Add("Самотен гроб в самотен кът, пустиня около немее — аз зная тоз самотен кът и тоя гроб самотен де е.");
			quotes["Славейков"].Add("И знам, че в тоз самотен гроб, таме в пустинний кът самотен, зарови милвана ръка един немил живот сиротен.");

			quotes["Милев"].Add("Първите паднаха в кърви. Метежният устрем бе посрещнат с куршуми. Знамената изтръпнаха пронизани. Планината гърми. . . Там горе далечни и близки хълми потъмняха обнизани с хора - плъпнаха черни редици редовни платени войници и разлютена милиция.");
			quotes["Милев"].Add("Прекрасно но - що е отечество - И яростно лаят картечници. . . Първите паднаха в кърви. ");
			quotes["Милев"].Add("Войските настъпваха. Под грозния звук на шрапнелите изтръпнаха и най-смелите в отчаяние към небето издигнати голи ръце. Ужас без слава замръзна на всяко лице - очи без страдание.");
			quotes["Милев"].Add("Там посред общия смут сам, като луд епически смелия поп Андрей с легендарния топ стреля снаряд след снаряд. . . В последния миг Смърт на Сатаната! извика побеснял и велик - и обърна назад своя топ последната граната изпрати право там");
			quotes["Милев"].Add("До телеграфния стълб бе изправен. До него палача. Капитана. Въжето бе готово. Балкана тъмнееше мрачен. Небето - сурово. Попа стоеше огромен, изправен в целий си ръст, цял спокоен като гранит - без жал без спомен - на гърдите Христовия кръст и с поглед в балканите впит - далеко сякаш в грядущето.");
			quotes["Милев"].Add("Тогава настана най-ужасното Бясно захласната заудря в душите тревожна камбана - удря, бие, звъни. . . Нощта падна тъй ниско - глухо и страшно заключена от всички страни.");
			quotes["Милев"].Add("Ахил беше грубата сила. Военния демон. Ахил беше стар генерал на Н. Ц. В. цар Агамемнон. Ахил бе герой. С безброй кръстове, ордени, ленти. . . Пиедестал на реда и тишината в страната.");

			Random random = new Random();
			int randomNum = random.Next(0, 10);

			string randomAuthor = authors[randomNum];
			List<string> quotesSequence = quotes[randomAuthor];
			string randomQuote = quotesSequence[random.Next(0, quotesSequence.Count)];

			return Tuple.Create(randomAuthor, randomQuote);
		}
	
		public Form1()
		{
			InitializeComponent();
			
			
		}



		private void textBox1_KeyPress(object sender, KeyPressEventArgs e)
		{
			if (e.KeyChar == (char)Keys.Enter)
			{
				button1_Click(sender, e);
			}
		}

		private void textBox1_TextChanged(object sender, EventArgs e)
		{

		}

		private void label4_Click(object sender, EventArgs e)
		{

		}

        private void Label1_Click(object sender, EventArgs e)
        {

        }

        private void Label2_Click(object sender, EventArgs e)
        {

        }

        private void Label3_Click(object sender, EventArgs e)
        {

        }

        private void Form1_Load(object sender, EventArgs e)
		{
			var Osem = Matura();
			MaturaAuthor = Osem.Item1;
			MaturaQuote = Osem.Item2;
			label1.Text = MaturaQuote;
			label3.Text = $"Общо отговорени въпроси: {CounterRight + CounterWrong} ,от които {CounterRight} са верни и {CounterWrong} грешни.";


		}

		private void button1_Click(object sender, EventArgs e)
		{



		if (textBox1.Text.Length < 2)
			{
				label2.Text = "Моля въведете автор";
			}
			else
			{

				if (textBox1.Text.ToLower() == MaturaAuthor.ToLower())
				{
					label2.Text = "Правилен Отговор";
					CounterRight++;
				}
				else
				{
					label2.Text = "Грешен Отговор, правилният автор е:" + MaturaAuthor;
					CounterWrong++;
				}
				double Score = (Convert.ToDouble(CounterRight) / Convert.ToDouble(CounterWrong+CounterRight)) * 4+2;
				textBox1.Text = "";
				label3.Text = $"Общо отговорени въпроси: {CounterRight + CounterWrong} ,от които {CounterRight} са верни и {CounterWrong} грешни.   Оценка: {Math.Round(Score,2)}";
				var Osem = Matura();
				MaturaAuthor = Osem.Item1;
				MaturaQuote = Osem.Item2;
				label1.Text = MaturaQuote;
			}
		}
	}
}
